
===========================================================================
report_tns
============================================================================
tns -262.15

===========================================================================
report_wns
============================================================================
wns -36.33

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -36.33

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.15
