
===========================================================================
report_tns
============================================================================
tns -271.73

===========================================================================
report_wns
============================================================================
wns -35.62

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -35.62

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.16
