
===========================================================================
report_tns
============================================================================
tns -918.89

===========================================================================
report_wns
============================================================================
wns -77.63

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -77.63

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.11
