
===========================================================================
report_tns
============================================================================
tns -901.71

===========================================================================
report_wns
============================================================================
wns -76.81

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -76.81

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.11
