
===========================================================================
report_tns
============================================================================
tns -885.23

===========================================================================
report_wns
============================================================================
wns -75.95

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -75.95

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.11
