
===========================================================================
report_tns
============================================================================
tns -291.91

===========================================================================
report_wns
============================================================================
wns -37.27

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -37.27

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.16
