
===========================================================================
report_tns
============================================================================
tns -265.48

===========================================================================
report_wns
============================================================================
wns -35.86

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -35.86

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.16
