
===========================================================================
report_tns
============================================================================
tns -259.29

===========================================================================
report_wns
============================================================================
wns -35.11

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -35.11

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.29
