
===========================================================================
report_tns
============================================================================
tns -258.82

===========================================================================
report_wns
============================================================================
wns -35.05

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -35.05

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.29
