
===========================================================================
report_tns
============================================================================
tns -231.85

===========================================================================
report_wns
============================================================================
wns -32.67

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -32.67

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.25
